day-21/load-test/stampede-ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Kestrel
Server Hostname:        localhost
Server Port:            5062

Document Path:          /api/quotes/2
Document Length:        240 bytes

Concurrency Level:      50
Time taken for tests:   0.019 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      18950 bytes
HTML transferred:       12000 bytes
Requests per second:    2659.01 [#/sec] (mean)
Time per request:       18.804 [ms] (mean)
Time per request:       0.376 [ms] (mean, across all concurrent requests)
Transfer rate:          984.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.5      2       3
Processing:     1    7   1.2      7      11
Waiting:        1    7   1.3      7      11
Total:          4    9   1.3      9      13

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%     10
  90%     10
  95%     10
  98%     13
  99%     13
 100%     13 (longest request)